; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v11)
             (pred_3 ?v10 ?v4)
             (pred_5 ?v9 ?v4)
             (pred_9 ?v7 ?v9 )
	     (pred_12 ?v9)
             (pred_7 ?v2)
             (pred_8 ?v10)
             (pred_6 ?v4)
             (pred_4 ?v9)
             (pred_2 ?v10)
             (pred_1 ?v9)
             (pred_10 ))



(:action op_2
:parameters (?v12 ?v6 ?v13 ?v5)
:precondition (and (pred_7 ?v12) (pred_7 ?v6) (pred_8 ?v13) (pred_6 ?v5)
          (pred_11 ?v12 ?v6) (pred_3 ?v13 ?v5)
                   (pred_5 ?v6 ?v5) (pred_12 ?v12) 
                   (pred_4 ?v6) (pred_2 ?v13))
:effect (and  (pred_1 ?v6) (not (pred_4 ?v6))))


(:action op_4
:parameters (?v12 ?v1)
:precondition (and (pred_7 ?v12) (pred_7 ?v1)
               (pred_12 ?v12) (pred_11 ?v12 ?v1) (pred_1 ?v1))
:effect (and (pred_12 ?v1) (not (pred_12 ?v12))))

(:action op_5
:parameters (?v12 ?v13)
:precondition (and (pred_7 ?v12) (pred_8 ?v13) 
                  (pred_12 ?v12) (pred_9 ?v13 ?v12) (pred_10 ))
:effect (and (pred_2 ?v13)
   (not (pred_9 ?v13 ?v12)) (not (pred_10 ))))


(:action op_3
:parameters (?v12 ?v3 ?v8)
:precondition (and (pred_7 ?v12) (pred_8 ?v3) (pred_8 ?v8)
                  (pred_12 ?v12) (pred_2 ?v8) (pred_9 ?v3 ?v12))
:effect (and (pred_2 ?v3) (pred_9 ?v8 ?v12)
        (not (pred_2 ?v8)) (not (pred_9 ?v3 ?v12))))

(:action op_1
:parameters (?v12 ?v13)
:precondition (and (pred_7 ?v12) (pred_8 ?v13) 
                  (pred_12 ?v12) (pred_2 ?v13))
:effect (and (pred_10 ) (pred_9 ?v13 ?v12) (not (pred_2 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_07 obj_06 obj_12 obj_22 obj_28 obj_13 obj_27 obj_16 obj_05 obj_08 obj_14 obj_15 obj_11 obj_09 obj_21 obj_20 obj_23 obj_17 obj_31 obj_19 obj_29 obj_18 obj_03 obj_10
    obj_25 obj_30 obj_02
    obj_04 obj_24 obj_01
    )

    (:init
       (pred_10)

       (pred_7 obj_26)
       (pred_7 obj_07)
       (pred_7 obj_06)
       (pred_7 obj_12)
       (pred_7 obj_22)
       (pred_7 obj_28)
       (pred_7 obj_13)
       (pred_7 obj_27)
       (pred_7 obj_16)
       (pred_7 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_14)
       (pred_7 obj_15)
       (pred_7 obj_11)
       (pred_7 obj_09)
       (pred_7 obj_21)
       (pred_7 obj_20)
       (pred_7 obj_23)
       (pred_7 obj_17)
       (pred_7 obj_31)
       (pred_7 obj_19)
       (pred_7 obj_29)
       (pred_7 obj_18)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_6 obj_25)
       (pred_6 obj_30)
       (pred_6 obj_02)
       (pred_8 obj_04)
       (pred_8 obj_24)
       (pred_8 obj_01)

       (pred_11 obj_26 obj_28)
       (pred_11 obj_26 obj_07)
       (pred_11 obj_07 obj_13)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_07 obj_26)
       (pred_11 obj_06 obj_27)
       (pred_11 obj_06 obj_12)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_12 obj_22)
       (pred_11 obj_12 obj_06)
       (pred_11 obj_22 obj_05)
       (pred_11 obj_22 obj_12)
       (pred_11 obj_28 obj_08)
       (pred_11 obj_28 obj_13)
       (pred_11 obj_28 obj_26)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_13 obj_27)
       (pred_11 obj_13 obj_07)
       (pred_11 obj_13 obj_28)
       (pred_11 obj_27 obj_15)
       (pred_11 obj_27 obj_16)
       (pred_11 obj_27 obj_06)
       (pred_11 obj_27 obj_13)
       (pred_11 obj_16 obj_11)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_16 obj_27)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_05 obj_22)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_08 obj_21)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_08 obj_28)
       (pred_11 obj_14 obj_20)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_15 obj_23)
       (pred_11 obj_15 obj_11)
       (pred_11 obj_15 obj_27)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_09)
       (pred_11 obj_11 obj_16)
       (pred_11 obj_11 obj_15)
       (pred_11 obj_09 obj_31)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_11)
       (pred_11 obj_21 obj_19)
       (pred_11 obj_21 obj_20)
       (pred_11 obj_21 obj_08)
       (pred_11 obj_20 obj_29)
       (pred_11 obj_20 obj_23)
       (pred_11 obj_20 obj_14)
       (pred_11 obj_20 obj_21)
       (pred_11 obj_23 obj_18)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_23 obj_15)
       (pred_11 obj_23 obj_20)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_31)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_31 obj_10)
       (pred_11 obj_31 obj_09)
       (pred_11 obj_31 obj_17)
       (pred_11 obj_19 obj_29)
       (pred_11 obj_19 obj_21)
       (pred_11 obj_29 obj_18)
       (pred_11 obj_29 obj_20)
       (pred_11 obj_29 obj_19)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_18 obj_23)
       (pred_11 obj_18 obj_29)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_10 obj_31)
       (pred_11 obj_10 obj_03)
       (pred_4 obj_20)
       (pred_4 obj_23)
       (pred_4 obj_19)
       (pred_5  obj_20 obj_25)
       (pred_5  obj_23 obj_30)
       (pred_5  obj_19 obj_02)
       (pred_1 obj_26)
       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_12)
       (pred_1 obj_22)
       (pred_1 obj_28)
       (pred_1 obj_13)
       (pred_1 obj_27)
       (pred_1 obj_16)
       (pred_1 obj_05)
       (pred_1 obj_08)
       (pred_1 obj_14)
       (pred_1 obj_15)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_17)
       (pred_1 obj_31)
       (pred_1 obj_29)
       (pred_1 obj_18)
       (pred_1 obj_03)
       (pred_1 obj_10)

       (pred_3  obj_04 obj_25)
       (pred_3  obj_24 obj_30)
       (pred_3  obj_01 obj_02)
       (pred_9 obj_04 obj_13)
       (pred_9 obj_24 obj_03)
       (pred_9 obj_01 obj_26)
       (pred_12 obj_16)
    )

    (:goal (and
       (pred_9 obj_04 obj_17)
    ))
(:constraints
  (always (not (pred_12 obj_27)))
)
)

; plan
1. (op_4 obj_16 obj_11)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_15)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_15)
   goals met: 0 of 1
3. (op_4 obj_15 obj_14)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_14)
   goals met: 0 of 1
4. (op_4 obj_14 obj_13)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_13)
   goals met: 0 of 1
5. (op_5 obj_13 obj_04)
   deleted: (pred_9 obj_04 obj_13) (pred_10)
   added: (pred_2 obj_04)
   goals met: 0 of 1
6. (op_4 obj_13 obj_14)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_14)
   goals met: 0 of 1
7. (op_4 obj_14 obj_15)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_15)
   goals met: 0 of 1
8. (op_4 obj_15 obj_11)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_11)
   goals met: 0 of 1
9. (op_4 obj_11 obj_17)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_17)
   goals met: 0 of 1
10. (op_1 obj_17 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_10) (pred_9 obj_04 obj_17)
   goals met: 1 of 1
